### Naive Bayes From Scratch
Nemshan 


- 1- prepare the data for Naïve Bayes algorithm 
    - a.	created a function named “preprocess” to take care of missing.
    - b.	created a function named “removeUcol” to drop the columns with only unique values. e.g. index numbers
    - c.	created a function named “label” to drop the response column.
    - d.	created two functions named “splitter_cat” to split the categorical variables.
    - e.	created a function named “normalize” to normalize  the features.
- 	2- Columns with only unique values were removed from categorical dataset
- 	3- Splitting Train and Test function 
-	4- Takes the size of the dataset and splits it 80-20 
	5- Returns train and test dataset 
	6- I Created a probability function 
	7- I Created prediction function
	8- I Created an accuracy function to determine the accuracy

In [3]:
import pandas as pd 
import numpy as np 
from Madefunctions import *
import math

In [66]:
#Titanic Dataset 
titanic = pd.read_csv("titanic.csv")
titanic.head()

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1
1,1,"Allison, Master. Hudson Trevor",male,NaN,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",1
2,1,"Allison, Miss. Helen Loraine",female,2.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0

In [67]:
newdf = preprocess(titanic)

file dimensions:  (1309, 14)

Columns in dataframe:  ['pclass', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket', 'fare', 'cabin', 'embarked', 'boat', 'body', 'home.dest', 'survived']
Number of NA in  pclass :  0
Number of NA in  name :  0
Number of NA in  sex :  0
Number of NA in  age :  264
Number of NA in  sibsp :  0
Number of NA in  parch :  0
Number of NA in  ticket :  0
Number of NA in  fare :  1
Number of NA in  cabin :  1014
Number of NA in  embarked :  2
Number of NA in  boat :  823
Number of NA in  body :  1188
Number of NA in  home.dest :  564
Number of NA in  survived :  0

DROP COLUMNS WITH MORE THAN 30 PERCENT NA
4  columns were dropped

 ['pclass', 'name', 'sex', 'age', 'sibsp', 'parch', 'ticket', 'fare', 'embarked', 'survived']

The new dimension:  (1309, 10)

DROP ROWS WITH NA

Clean dataframe dimension  1042  rows and 10  columns

In [68]:
newdf.head()

,pclass,name,sex,age,sibsp,parch,ticket,fare,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,29.0,0,0,24160,211.3375,S,1
2,1,"Allison, Miss. Helen Loraine",female,2.0,1,2,113781,151.5500,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0,1,2,113781,151.5500,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,S,0
5,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,S,1

In [69]:
categorical = splitter_cat(newdf)
categorical.head()

,pclass,name,sex,sibsp,parch,ticket,embarked,survived
0,1,"Allen, Miss. Elisabeth Walton",female,0,0,24160,S,1
2,1,"Allison, Miss. Helen Loraine",female,1,2,113781,S,0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,1,2,113781,S,0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,1,2,113781,S,0
5,1,"Anderson, Mr. Harry",male,0,0,19952,S,1

In [71]:
categorical = removeUcol(categorical)

In [72]:
train, test = traintestsplit(categorical)

In [73]:
train.head()

,pclass,name,sex,sibsp,parch,ticket,embarked,survived
0,1,"Cardeza, Mrs. James Warburton Martinez (Charlo...",female,0,1,PC 17755,C,1
1,3,"Pickard, Mr. Berk (Berk Trembisky)",male,0,0,SOTON/O.Q. 392078,S,1
2,1,"Bazzani, Miss. Albina",female,0,0,11813,C,1
3,3,"Andersson, Miss. Erna Alexandra",female,4,2,3101281,S,1
4,1,"Fortune, Miss. Alice Elizabeth",female,3,2,19950,S,1

In [75]:
train2 = train.drop("name", axis=1)

In [76]:
train3 = train2.drop("ticket",axis=1)

In [77]:
train3.head()

   pclass     sex  sibsp  parch embarked  survived
0       1  female      0      1        C         1
1       3    male      0      0        S         1
2       1  female      0      0        C         1
3       3  female      4      2        S         1
4       1  female      3      2        S         1

In [78]:
test.head()

,pclass,name,sex,sibsp,parch,ticket,embarked,survived
0,2,"Bateman, Rev. Robert James",male,0,0,S.O.P. 1166,S,0
1,3,"Panula, Master. Eino Viljami",male,4,1,3101295,S,0
2,3,"Hirvonen, Miss. Hildur E",female,0,1,3101298,S,1
3,3,"Lindell, Mr. Edvard Bengtsson",male,1,0,349910,S,0
4,3,"Klasen, Mrs. (Hulda Kristina Eugenia Lofqvist)",female,0,2,350405,S,0

In [79]:
test2 = test.drop("name", axis=1)

In [80]:
test3 = test2.drop("ticket", axis=1)

In [81]:
test3.head()

   pclass     sex  sibsp  parch embarked  survived
0       2    male      0      0        S         0
1       3    male      4      1        S         0
2       3  female      0      1        S         1
3       3    male      1      0        S         0
4       3  female      0      2        S         0

In [45]:
prob, col, L = probdict(train3)

Enter Response Variable: survived

In [46]:
prob

{0: {'embarked': {'C': 0.13877999999999999,
   'Q': 0.065310000000000007,
   'S': 0.79591999999999996},
  'parch': {0: 0.81223999999999996,
   1: 0.10000000000000001,
   2: 0.065310000000000007,
   3: 0.0061199999999999996,
   4: 0.0061199999999999996,
   5: 0.0081600000000000006,
   6: 0.0020400000000000001},
  'pclass': {1: 0.16531000000000001,
   2: 0.23061000000000001,
   3: 0.60407999999999995},
  'sex': {'female': 0.15714, 'male': 0.84286000000000005},
  'sibsp': {0: 0.68776000000000004,
   1: 0.21632999999999999,
   2: 0.038780000000000002,
   3: 0.020410000000000001,
   4: 0.026530000000000001,
   5: 0.0081600000000000006,
   8: 0.0020400000000000001}},
 1: {'embarked': {'C': 0.31195000000000001,
   'Q': 0.03499,
   'S': 0.65305999999999997},
  'parch': {0: 0.63848000000000005,
   1: 0.21282999999999999,
   2: 0.13120000000000001,
   3: 0.014579999999999999,
   5: 0.0029199999999999999},
  'pclass': {1: 0.42565999999999998, 2: 0.26822000000000001, 3: 0.30612},
  'sex': {'female': 0.67930000000000001, 'male': 0.32069999999999999},
  'sibsp': {0: 0.60641,
   1: 0.32362000000000002,
   2: 0.043729999999999998,
   3: 0.017489999999999999,
   4: 0.0087500000000000008}}}

In [47]:
test3.head()

   pclass     sex  sibsp  parch embarked  survived
0       3  female      1      1        Q         0
1       2  female      1      2        S         1
2       3    male      1      0        S         1
3       2    male      1      1        C         0
4       1  female      1      0        C         1

In [48]:
col

'survived'

In [49]:
L

[0.5882352941176471, 0.4117647058823529]

In [50]:
prob[1]["embarked"]["C"]

0.31195000000000001

In [51]:
T =  predict(prob, test3, col,L)

In [52]:
test3.head()

   pclass     sex  sibsp  parch embarked  survived  predict
0       3  female      1      1        Q         0        1
1       2  female      1      2        S         1        1
2       3    male      1      0        S         1        0
3       2    male      1      1        C         0        1
4       1  female      1      0        C         1        1

In [53]:
naiveaccuracy(T)

165
209

78.94736842105263

In [61]:
d = {}
f = {}
# ls = [2,2,5]
# ls2 = [5,7,8]
features = train.columns.values
features = features.tolist()
for feature in train:
    d[i] = []
    f[feature] = []
    
print(d)
print(f)

{'pclass': []}
{'pclass': [], 'name': [], 'sex': [], 'sibsp': [], 'parch': [], 'ticket': [], 'embarked': [], 'survived': []}

In [62]:
ls = list(set(train3["survived"]))
d = {}
f = {}

features = train3.columns.values
features = features.tolist()
for i in ls:
    d[i] = []
    for feature in features:
        f.update({feature:[{1:"a"},{2:"b"}]})
    d[i] = f
    
    
print(d)

{0: {'pclass': [{1: 'a'}, {2: 'b'}], 'sex': [{1: 'a'}, {2: 'b'}], 'sibsp': [{1: 'a'}, {2: 'b'}], 'parch': [{1: 'a'}, {2: 'b'}], 'embarked': [{1: 'a'}, {2: 'b'}], 'survived': [{1: 'a'}, {2: 'b'}]}, 1: {'pclass': [{1: 'a'}, {2: 'b'}], 'sex': [{1: 'a'}, {2: 'b'}], 'sibsp': [{1: 'a'}, {2: 'b'}], 'parch': [{1: 'a'}, {2: 'b'}], 'embarked': [{1: 'a'}, {2: 'b'}], 'survived': [{1: 'a'}, {2: 'b'}]}}

In [63]:
def binning(df):
    col = input("Pick a column to bin: ")
    colmin = min(df[col])
    print(colmin)
    colmax = max(df[col])
    print(colmax)
    diff = colmax - colmin 
    print(diff)
    numb = int(input("number of bins: "))
    bins = diff / numb
    ls = []
    
    for n in range(1,numb+1):
        bb = str("b") + str(n)
#         ls.append(bb)
        bb = colmin + (bins*n) 
        ls.append(int(bb))
#         print(bb)
    print(ls)
    t = str("0-")
    for row in df[col]:
        
        for i in range(0,len(ls)):
            
            if row < ls[i]:
                s = t + str(ls[i])
                df[col] = df[col].replace(row, s)
                t = str(ls[i]) + "-"
                
        
        
    print(df.head())

In [64]:
binning(clean)

Pick a column to bin: sibsp
0
8
8
number of bins: 5
[1, 3, 4, 6, 8]
   pclass                                             name     sex   age  \
0       1                    Allen, Miss. Elisabeth Walton  female  29.0
2       1                     Allison, Miss. Helen Loraine  female   2.0
3       1             Allison, Mr. Hudson Joshua Creighton    male  30.0
4       1  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.0
5       1                              Anderson, Mr. Harry    male  48.0

  sibsp  parch  ticket      fare embarked  survived
0   0-1      0   24160  211.3375        S         1
2   8-3      2  113781  151.5500        S         0
3   8-3      2  113781  151.5500        S         0
4   8-3      2  113781  151.5500        S         0
5   0-1      0   19952   26.5500        S         1